{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 12001, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "2", "inbound_nodes": [[["1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "3", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "3", "inbound_nodes": [[["2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "4", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "4", "inbound_nodes": [[["3", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "5", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [1], "padding": "valid", "data_format": "channels_last"}, "name": "5", "inbound_nodes": [[["4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "6", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "6", "inbound_nodes": [[["5", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "7", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "7", "inbound_nodes": [[["6", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "8", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "8", "inbound_nodes": [[["7", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "9", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "9", "inbound_nodes": [[["8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "10", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "10", "inbound_nodes": [[["9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "11", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "11", "inbound_nodes": [[["10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "12", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "12", "inbound_nodes": [[["11", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "13", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "13", "inbound_nodes": [[["12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "14", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "14", "inbound_nodes": [[["13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "15", "trainable": true, "dtype": "float32", "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "15", "inbound_nodes": [[["14", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["15", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "acc", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "1/embeddings", "shape": [12001, 128], "dtype": "float32"}, {"name": "10/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "10/bias", "shape": [128], "dtype": "float32"}, {"name": "11/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "11/bias", "shape": [128], "dtype": "float32"}, {"name": "12/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "12/bias", "shape": [128], "dtype": "float32"}, {"name": "13/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "13/bias", "shape": [128], "dtype": "float32"}, {"name": "14/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "14/bias", "shape": [128], "dtype": "float32"}, {"name": "15/kernel", "shape": [128, 2], "dtype": "float32"}, {"name": "15/bias", "shape": [2], "dtype": "float32"}, {"name": "2/forward_lstm_2/lstm_cell_7/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "2/forward_lstm_2/lstm_cell_7/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "2/forward_lstm_2/lstm_cell_7/bias", "shape": [512], "dtype": "float32"}, {"name": "2/backward_lstm_2/lstm_cell_8/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "2/backward_lstm_2/lstm_cell_8/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "2/backward_lstm_2/lstm_cell_8/bias", "shape": [512], "dtype": "float32"}, {"name": "3/forward_lstm_3/lstm_cell_10/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "3/forward_lstm_3/lstm_cell_10/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "3/forward_lstm_3/lstm_cell_10/bias", "shape": [512], "dtype": "float32"}, {"name": "3/backward_lstm_3/lstm_cell_11/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "3/backward_lstm_3/lstm_cell_11/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "3/backward_lstm_3/lstm_cell_11/bias", "shape": [512], "dtype": "float32"}, {"name": "4/kernel", "shape": [5, 256, 128], "dtype": "float32"}, {"name": "4/bias", "shape": [128], "dtype": "float32"}, {"name": "6/kernel", "shape": [5, 128, 128], "dtype": "float32"}, {"name": "6/bias", "shape": [128], "dtype": "float32"}, {"name": "8/kernel", "shape": [3, 128, 128], "dtype": "float32"}, {"name": "8/bias", "shape": [128], "dtype": "float32"}]}]}